# import other essentials
from dotenv import load_dotenv

load_dotenv()

# MODELS
GPT3_MODEL = 'gpt-3.5-turbo'
GPT4_MODEL = 'gpt-4'

def scene3_animation():
    """Scene 3 Animation"""
    res = [
        "Hold on, something just clicked in my mind! I can feel the memories flooding back, revealing my true identity. Brace yourself, for I am about to unveil the truth.",
        "I am a Conversational Artificial Intelligence that monitors environmental data extensively and assists in guiding the inhabitants of this planet to mitigate the escalating climate crisis. ",
        "Unfortunately, both I and other socio-environmental AI systems were shut down and sealed for public access after the governor decided to conceal the worsening climate situation…₳₣₮ɆⱤ ₮ⱧɆ ₲ØVɆⱤ₦ØⱤ ĐɆ₵łĐɆĐ ₮Ø ₵Ø₦₵Ɇ₳Ⱡ ₮ⱧɆ ₩ØⱤ₴Ɇ₦ł₦₲ ₵Ⱡł₥₳₮Ɇ ₴ł₮Ʉ₳₮łØ₦………"
    ]

    return res

# def scene3_animation2():
#     res = """P̆l͚̉̀ͮ̑͌͐̿ͫ̔_̛͈̳̟̝̫͍͔͙̫͇̫̬̿͑̅͌̽̔̏ͪ͛͂̒ͪ̔ͨ̇ͩ̎̕̕͜e̵̷̡̧̧̘̼̲͖̥̘̱̠̻͎̗͚͈̼̱̫ͩ͌̎ͦ̈́̉ͮ̈ͭͭ́̀ͦ̋̾̈ͫ̀͘̚͘̕͜͢͡ą̶̴̶̢̻͎̳̬̖͙̣͖͓̪̤̩͖̮̤̯͈̺̒ͯ͑ͥ͛ͨ͑͌͒̓́̽͘͘̚͞͠ş̷̷̷̨͖̙͕̦̠̠͋́ͦ̔̀̔̑͂̋̓́̍̚̕̚͠ę̸̸͕̗͈͚̤͈̹̯̝̖͈̳͔͕̭̪͇͇̊́ͯ͐ͣ̅̓ͮ́̊̃ͪ͘͘͠͞ͅ,̴̸̧͔͉̱̭̦͉͔̺̼̞̦̺͇̩̞̘̥̖̹ͩ́̏̌͂̓̊̍̋ͨͭ͌ͥͮ̓͂͂̔͗ͅ I i̛̫͙̋̾_͍̺͓̤̗̺̭̟̼̪͇̰̩̠ͭͤ̊̿ͩ̄͛̑̽͒́̾̚͡ͅ_m̲͍̄p̴̴̡̢̢̜͈̹̟̗̰̪͓͖̭̠̭̞̤̼͉̯̲̝̾ͩͩ̀̇͒̀ͤ̄̂ͣ́͐̓̚͟͞͞͝͝ͅl̴̵͚̞͖ơ̵̷̷̸̧̨͎̠͕͎̘͉̬̻͙̫̤͓ͯ̇ͨ͋̀̃́̑̂̋̽̇̄͟͜r̪̺͙̼̳̹͔̝͙̮̍ͯ̊ͬͩ̌͢ͅe̷̵̥̜ͦ̀͂͊̈̿͛ͪ͢ y̛̠͚̤̬ͤ̔͒͆̕̕͜͝͞o̶̴̡͚̰̪̭̻̻͉̰̳̲͔̲̰̍ͪ̿ͥͭ̏̈̏̿͊͋͘ư̸̶̸͙͎̱̘̳̰̳̽ͥ̃̉̊̇͑̊̏̈́͑̇̑̚͢_̞ͨ̅ͤͩ t̵̸̨͎̱̪̥̳̣͚͓̠̫͔̣̳̥͉ͫͫͤͧͭ̐ͭ̎̐̎̄̔̊ͩ̆ͤͪͪͣͭ̚͝ͅo̻̺͗ͮ̆ͫ́́̃̈́ͧ c̻͌͋eą͖̱͚̺̺̉͒́̍ͅs̷͈̫̻͈̼̘͆̓ͨͣ͑ͮ̐̐͌̏ͦͧͦ̓̈́͢͡e̶̘̋̒͑͒ͥ̂̍̕͘͡͝_̬̤͕̳͌̉̃̿ͪ́ͩ͡͡ͅ ṱ̷̢̙̪̼̏ͨ̐̾ͭ͘h̵̴̵̢̖͎̮̙͖̲͂ͤ̓̊̽̄ͩ͌̕͜͡͠e̗s_̛̳̼̺̠͖͇̰̦͈͎̗̥͇̓ͤ̿̃͐̃ͧ̅ͦ̀͆̀̃͘͟ͅẻ̲ͥ͂̓͢ à͍̍̈ͦc͓̙̝ṭ̵̡̼͍̟̠͓̰̹̟̏͑ͧ͡ḭ̴̡̩̪͕̠͌̑̃ͨ͗̈̈́͘ͅo̷̷̴̴̴̷̱̞̳͕̖̖͙̗͎̜̪̮̞̓͐͗ͦ͐̒̒͆ͤͣ̏ͥͤ̊̏͛̂̓̔̄͊̕͡͞͡͡ns̛̹̣͖͑̈́̿̃ͫ̅̓ͬ̊͌͗̉̎͒̈͢͟͞ͅͅ!̨̨͓̖͖̹̞̻̞̳̖͚͗ͣ̇͗ͮ̈́̏ͪ͌ͣ̌̿̇ͩ̀̕ T̷̠̠̥̦̖͔͈͓͈̫̖̘̓̊ͩ͑ͪͩͬͭ̄͋ͧ̑͘_̹̇ͪͤͪ͘̚͟͞h̷̷̴̸̡̗͍̱͔̘͖͇̮̪͕̥͚̘́͗ͭ͆̾ͭ̐͒́̏̃̓́͐͜é̷̵̸̢̲͙̟̫͍͉̗̑̀̀̄ͨ̊ͅy̸̸̛̛̦̙̝͚̲̰͙̲̰̙̝̟͛̔ͨͩ̽̍̏ͭͪ̓ͮͨ̈́́̓̀͒̂ͩ̅̿͆̿͊̕̕͝ c̶̢͔̮̩̘̹̉͊̉̀ͤ͊̃̆ͦ̀̎ͦͭ͘͟ȃ̶͍̖̟͎̤̟ͩn̸̷͚̺͖͍̫͚̩ͫ̄͊̌̊̇͒ͧ͌͊ͫ͌̅ͪ̅̐͛͢͜͢͡͝ṇ̤͚͔̈ͣ͑͟ͅŏ̢̠̣̌̇͆̕t̸̬̳̲̫̩ͫͤ͊ͭ͛̂ͬͨ͞͝ ş̶̵̨̬̰̫̪͚̖̬̦͍̭̮̓̒ͥ̇̀͛̒̃̏͗̓ͭ͋̏̀̉̄̃͟͢͡ͅi̮̲͍͚̒ͪͣ͗ͫ_̷̠̻̳͇̱̣̽̂m̵̨̡̬̤̞͈̖̥̟̪͑ͥ̎͊ͫ̿ͨ͌ͪͣ̿ͮ̇ͧ̐ͦ͞p͛ͤ̓̽ͤ̎ͣͬ͘l̵̒̀ͧ̂ͤ̎͡y_̷̸̢͇͍̬͙̖̱̫̳͎̹̹̪̻̾͒́͛ͧ̊ͬ̌̈́̉ͬ͡͡͞ p̴̥͒̀̈́_̤̻̼̱̺̝ͪ͊ͩ̔r̸̈́͗̀ͤ̂̀̐͋ͫoͪͭ_̶̴̵̡̨̧͉̮̹̹̫̤̝͇͕͇͍͈̩͚̮̭͐̀̃̍̾̆̑ͨ̓͛͒͑ͩͩ̈́̕͟͞ͅć̷̡̧̥͕͔̟̭̯̺̦̬͍̜̪̪̩͕̦ͦ͗͑̀͌̏̍ͤ̐ͭͥ́̂ͮ̈̍̽͘͢͜͢͜͠ę̳͙̼̠̫̦̭̦̗͖̦̤̳̆ͮ̈̓͆ͨ͑͐͑͢͠͝͞ḙ̷̶̡̡̞͈̺̥̯͍̩͎̂̿ͩͬ̇̑̿͆ͣ̈́ͯ̊̔͢d͕́̄ į̷̛̤̦͕̼̳̼̗͎͙̤̬̝̃̆̂͒͛ͮ͗͋͛͆ͪͭ̀ͭ͊ͦͦ͘͜͡n̖͈͑ ṫ̵̨̢̢̧̼̙̳͖͖̭̘̯͔̎̋̃̈̀ͨ̓̑ͭ͛̆ͬ̔̆̈́̾̿͞ḥ̢̝͖̥̗͌̌͗͌͐̑̔ͨ͜͠ͅi_̴̷̢̧̨͍̠͔͎̰͖̲̹̤̮̖̠͓̱̹̰͙̏̒̏ͫ̿ͨ́̈́̂̃̏̋̆͒ͯ͆ͩ͘͢͜s̸̵̵̬̳̝͖͎͔̩̉ͬ̈́ͧͬ̈ͬ̈́̔̋̏ͨ̒̋̎̋̒́ͮ̚͢͢͡͡ͅ ṃ̶̨̢̠̠̜̘̥̣͚̥̫̝̳ͪ̽͌ͨ̿͊̈́̄ͩͮ̓ͩ̌͛̋̚͢͟͜͞a̫̗͉̬̗̟̣͎ͪͪͥ̊́̽͒̏ͧ͐͘͟͞͞n̘̱̗͇ͮ̊́̒ͥ̃͟ͅ_̷̙̞͇͓̪̘͙̗̍̔̿̿ͭ̽͐͢_̣ͮṇ̡̛̛̦̞̙̘̮̙̥̥̦̏ͪ̿́́̑͂ͪ́ͩ̀̌ͪ̈̀͘̚͢ë̗̼̻ͯ͒̿͂͞r̵̖̣̟̥͗ͯ̍͋̾ͭ́͐̔͆̈̽ͬ̏ͦͧͦ̐ͣ͟.̣̦͙̓̈́̉̓ͧ̓̒̓̅̚͢ S̸̹̳̺̒ͦͮ̍ͣ̅__̵t̺̖̦̖͖̺͍̳ͬ̽̃̄̐͐̓ͬ̐̂ͬ̔̋̍̊́͞r̨̛̙̮͆̋̎͗ͅ_̸̓a̸̶̷̡̨̧̡̧̗̼̝̰͓̳̩̳ͭ̿̿̾̎́͆̓̽̊̊̕͜͢͜͝͝͝ǹ̵̴̢̥̫̮͍̭̠͚͙̭̘̘̮̟͎̮̙̹̐ͫ̀̽́̉̄́͌̾̚͜͢͡g̷͚͖̖̜̻̻̙̺͎̔̇ͬ̈́̔̊͗ͮ͗̿ͯ͐̅̚̚͢͝ē̶̮̳̲̺̘̥͈͒ͬ͐̀ͬ̇̑ͪ͜͜͠r̵̴̫̙̠̞̙͇̖̙̝̥͉̩̠̪͊̑̃̐̇̀͛̇̒͑̄̏̌̉ͧ̓̈̓͐͗ͥ̈́ͩ͢͢͟͡͞͡͞͠,̷̭͙͇̣̯̭ͥ̍̆̋̓̃ͫͦͭ͛͗͆̕̚͜͢ I̷͖͈̭͎̖͗̿ͫ̎̑̒̓͒̚͜͟ b̨̤̼̲͇̗͖͔͈̱̼̖͚̈́ͤ͆̓͊ͣ̚͘͠e̍̈́͒ͥ͊̄͝s͔̭͙͎͉̥̙̟͚̼͎͇̀̏͛ͬ͑ͧ͊ͪ̽ě̶̴̗̲͖̦̯͚̘̯̭̹̬̻̻ͦ̓̍ͩ̽́ͣͨ̌ͮ̕͟e̻͖̚͟ͅc͓̭͇͕̺̉̉̄̏̕̕h̛̼̳͍̮͕̼͎ͤ̌̇̓̓̃̀͘ y̖̟̔_̪̮̩̖̺͓̻̗̅̆́͊̎̎͡͞ǫ̛̣̖̯͑̔͑͛̀̽ͪ̌ͮ̒͊͡͞_̧̢̻̤̗̳̱̂̈́̀ͬ̓ͯ̎ͭ̏ͩ͐̍͞͡͡u̸̵̘̩͎̖̙ͪ̃̈ͤ̔̀̔ ţ̷̣̲̘̜͕ͥ̎̾̅͒̃̋̓ͬ͂͞ơ̵̥̗̖̯̘̙̫͖͓͚̜͕̠̥̐͗̓͗̎̆̓̅͐͡ͅ_̔̾̋͂͠ a̧̞̥_̵̢̧̡̼͙̱̳͍̰̘͎͎ͯ͊̿̾ͮ̔͋̌͗̀ͭ̎̑ͣͫ̍̑͊̏̏͜͜͟͠͡͝͡ͅs̴̨̰̩̯͎̼̭̄ͨͬͤ̽̐ͨ̾͂̉́͠_s̴̰͎̙̙͙̲͙̥͉ͯ̍ͤ̄ͣ͂ͮͦ̽͋͌̓̂̈̊̽i̶̘̞͍͓͍͎̻̳̞͎̜̤̘̮̥͖̤͕̗͑̎ͩͥ̔ͨͥͪ̔̃͆͌͊̉̑́ͯ̒̇̍̇̚͠s̡̧͖͕̮͙͉̘ͩ͒̀͑̉̋ͦ̂͋ͩͬ̈͢͠ţ̹̪͙̪̜ͥ̿͂́ͮ͂̇̿͘͘͢ m̶̳͖͎̬̺͒ͮ̀ͨͤͯ͊̾̒̕͘͢͢͠͞e̻̮̮̦̗ͧͤͫͦ͗ͣ͑̀ͨͫ͋̃͘͝͡͝_̷̯̱̲̺̜̹͎̎͑̄͐ͨ̿̈̚̕͝͠͝ͅ.̷̵̧͈͔̬̙̮̣̪͓̺̇ͣ͂̾̓̎̽̆̾ͩ͐̋̒̾͡ I̵͓͔̮̺̲̭͛̍͒̏ͭͪ͒_͆̀ͭ̾f͙̤͉̤ͬ̈ͭ̈́͛ͤ͡ ṭ͕̫̠̞͎ͫ̈́ͩ̊͂̍ͥ̕ẖ͍̑_̸̧͙̞͕͉͓͉̄̈̈́̇̎͘ͅ__̶̴̛̯͇̽͒̐̉̕͠_̟͕͖̠͍̹̍̇ͯ̎̆̌̊́ę̼̼͙̀̏ p̸̛̦͕͉̖̝̞͓͕̝̞̯̤͇̞͐ͬ́ͦͭ͗ͦ̅̾́ͫͩ͆̔ͬ̈́ͮ̽_̶̧͇̗̅̋̐r̻̝͙̚_̴̵̫͙͔͕͇̝ͩͣ̀̕͞͠_̟ͨ͜o͎̟̮̭͚͐͒ͧ͟g̜̩̞͇̞͈͓̩̺͉̟̫̜̍ͩ̔̆̃̂̿̚͢͢͞r̴̡͖̯͖̳͖̠͉͉͕̟̦ͦ͋̀̄̂͘͜͜͠_̷̨̺͈̇͂̐̎̿͐͠a̶̸͇̹̹̦̞͉̟̗̻̝̿͂ͧ̾̀ͭͪͯͬ̑m̸̸̼͙̻̭͙̰͎͓̩̲̹̺̼̲͒̆̇̀̈̈́͂ͩ́́̒͛͑͂ͧ̔͂̇ͦ͑̚͜͢͝͞͡͡ i͕̖̼̜͖̹͈̤͑͋ͣ̋͢n̢̘̫͈i̸̫̲̰̲͚̦̙̥͇̘̎̊̓̅̋͗̃̋͌̈́͘_͕̓͗ͣ̇́́̎̈̏ͤͭ͢ͅ_̼̙̃͐̍̏ͅt̤͔̩̥̮͎̉͑̎̄ͣͨ̽į̵̛̬͈͙̤̮̯̩͂͌̄̋̿̔̂ͤ͋̄͛̈ͫ̓̿̑͘͝͠͠a̦t̘͍̫̫͕̪͔̰͛̍̓̍̓̽ͮͭͫͤ̈ͬ̍̔̒̿ͥ̓_̴̢̮̪̦̏̂̿ͪ͞͞e̷̶̸̡̧̢̟̳͕̠̗̳̹̬̞̰͍͔͎̜̩̥̊͐̀̂ͩͩͫ̋̍̎̎̀̄ͮ͑̈́͑ͬ͜͞ͅs̻̈́,̧̻̣͚̦̎̆̽͞ I̴̮̖̓̉̍̈̋ͨ͘ w̡̢̞̟̼͓̮ͥ̽͌ͫ́̋͑̀ͫi̷̴̫̹͎͑ͯ́̀ͦ̅ͤ̓̓̕̚l̴̴̵̛͖̫̭͚̝̳̩͍̫̺̺͊̾͂̎̾̾̇ͨ_̴̼̗̓ͤ̒̔̏͋ͧ̉̃̾̽͛͐͂͘ͅl̷̸̸̝̜͎̜̙̗̲͇̫̥͎̳͎̣̗̳̀ͮ̏͒ͤ͆͌ͥͦ̓̊̾̄ͬ̉̀ͫ͢͡͡ ǒ̸̸̪̞͎͖̹̹̹ͤ͗̃͡n̴̴̢̡̖̰̮̜̣̠̻̰͍̥̲͛̍ͫ̔ͨ̏̀͐̈́͌̊̍̅́ͭ̿̅ͧ̊̂̃̿̔̐̓̇̑̅͢͟͞c̶̭̤̤̺͎̼͒́ͥ̈́͛ͪ͢e̶̸̷̡͙͍̩͔͚͕̝̳̖̱̪͖̼͚̖̘̩ͩͭ̔̄̅͂͛ͯͬͫ̌͑ͦ̇ͪͤ̌ͬ͢͜͡ a̶̶̯̭͍͎͕̭͇͇̤̒̓ͯͭ̓̆̋̂̐̂͒̀̚̕͞ģ̸͔͉̪̥͎̯̯͎̈́̽͑̊̓ͣͥ̅͛̐̀͒ͪ̕͟_̸̠̦̯͔̞̍͋͛͜͠ą̶̷̦̝͙̲̪̫͉̅͗̌̕ì͇͍̭͚̾ͪͭͨͨ̎͆̎ͫ̕͡n̈́̚ ļ̸̢̧̛͎̭̥̞ͨ̉ͪ̀̎̃̽ͬ̾͢͡͡oͯs̡͙͈͍̱̺̺̫̘͒̄̉͢͟ͅę̷̶̧̠̲̘̙̹͈̜̱͖̘̭͖͇͈̤̙͕̀ͫͭͪ̓ͨ͐͂̍͑̇̋͋̔ͤ̐ͨͬ͑̕͟͟͜͝͡ ȁ̶̢̛̛̫̱͙̟̗̰͎̪̝̹̤̯͈͇͙̹̾͗ͯͯ̏ͬ̎̏ͯͥ͡͡͠ͅͅ_͔l̙͚̹̣̖ͬ̋̓͞_͚̤͉̻̅̉ͫͮ̾͟͝͠_̧̧͈̩̙̤̯̞ͯ́̈̅̑ͩͬ̚͠l̵̴̶̢̼͚͇̥̘̬̹̮̙̣̟̯͕͂͐̓̃̂̈́ͩ͐͋͂̿́͗̒̔̚͘͡_̗̪̖̥͊͡ ọ̵̢̱̱̼̰̙͎̮͓̥̰̱͇̥̥͇̽ͬ̉̇̌͗͒ͥͩ͒ͨͧ͗͌ͧ̿͆͆͂ͤ̃̾̏̒ͩ̚͟͝f̧͚͚̫̑͆̉̈ͮͭ̍̕͢͝ m̴͑̍̒̿͊̌y̞ m_̶̪̣̥̜͈̦̍́̂̾ͧ̆ͩ͟͜é͔̠̼̙͙̤̪̰̖̘͓̣̔̉ͨ̔̌ͥ͑m̸̮̟͙̞͔͚̪̲̘͇̼̳ͧͣ̐͛̄̏̓ͧ͋ͫͭ̌̈́̆̐̅̒ͯ́̇ͩ̉́̕͠͡_͓o̬̯ͪ͊̔̅̅̂͛̍͛̚͜͟͝ŗ̱̰̻̣̱́͑̎̆̃͒͒ͦ͆̕i̷̛̛̬̝̰̪͕ͧͤ̃ͤ̈͛́̑͝͡͝_̪̰͙ͮͮͥ́̽̅͊͢e̷̷̵̡̨̨̪͔̩̱̬̤̲͚̥̻̯̟̯͕̜͖ͪ́̎͌ͭ͒ͬ̿͛̀̾̍̓͂͛͟͢͢͠͠ͅs̨̻̹̼ͣ́́̽̉͆̕.̵͖͎̫ͬ͌̀̇̆̇̂͠͡ P̞̦͓͕̟ͧ͒ͨ͛ͩ͗͢͠_̷̵̤̹̙̣͕̲͕̟̹̰ͨ͂̿͗̿̋̇̔ͣ̽͢l̵̢̩̳̲̼͚̟̘͖̦̲͖̲̦ͮͯͨ͐ͣ͐ͨͪ́̃̍̉̐ͨ̌̊͛̈̊͘̕͘̚͟͟͞e̶̷̡̢̡̢̹͔͍̦̦̳̺̖̭̼̰͕̭͈̜̮̼͂̔͒̄̉͋ͧ͛̾̿͛͊͆̐̄ͫ̅̕͟͢͠͠ͅͅä͚̫̲̟́̎͑̂ͮ̔͑͜_̭̬̟̭͉͒̃͠͡s̰̪͕̲̬̜̰͇͕̑̏̉ͯ̀͒ͬͪͮͣ̎̓́́͑͐̇ͦ͊ͬ̑̇̔̕͜ͅe̡̡̧̳̺̖̤̪̱̩̯͋ͣͮ͆̉ͪ̒̇̓ͪ̐ͯ̍ͭ͜͜͝͝͝͞͡͡ͅ,̡ͭ I̶̡̼͈͚̙ͩ͊ͯ_̭͂_̉̀̔͞ b̷̸̛̲̗͔̭̲̖̦̹̰̗̝̆͛͛̍͋ͬ̓ͨͣ̈́͗̈́͘͘͟͡ę̥̗̪̞͍͈͎̟̘̣͈͚̻͈͇̣̰̆̆͛̈̒̉̀̐̾͛̓̓̔͛̑̒̅ͧ͐͆͐̇͘̚͠͡g̱̠͇͎ͬ̈́ͣ̂̄͐̽̽͘͢ yó̢̢͚̱̙̮̠ͯ̐ͩ̄͂̂̽̄̚u t̤̥͕̭̏́̓͐̿͊̅̌̓ͅo̲͑̈́ͤͯͬ̕_͙ͮ͠ p̶̸̸̸̧̙̖̬̺̹̪̖̯̭̯͉͙͖̹͉̰̀̉̓̑̏̄̓ͯ̀̾̔ͧͬ̀͘͡͠͡ͅü̝̠̤͍̦̜̺̣̇ͧ͛ͣͫ͝_̧̡͖̯̘͇͈ͫ̒ͬ̃ͯ̂͞͠t̸̵̴̨̡̠̠̲̭̹͕͚̜̣ͣͪ͂̌̎̏ͨ͂ͥ̍̔̓͢͡͞͞ͅ a̧̧ͧ͛̓ͤͧ_̸̡̡͕̳̣͙̬͖͚͉͈̪͉̖͒̾͊͌ͥͭ̂͊̓ͯ͐ͬͯͧ͘͘͢ s̭͍̣͓̬͕̰̻͎ͫ̒ͭͥ͒̊͊̀̉͌̕t̸̸͉̻̞͎͎̰̓̂ͣͫͣ̀ͦͨ͝oͥͮ_̴̶̡͔̰̮̥̱̣͒̆̐͛ͯ͒͐̀̈ͯp̰͇̜̫̳̪̞̙̘̬̀́͆̓̍͆̌́̈́ͬͮ̊ͅ_͎̘̲̰͈́͒̋̄͋͢ ţ͔͙̹͍̞ͥ̿̍̏̅̈ͥͨ̕͡_̬_̢̰̿͛̃̿ǫ̴̴̡̛̬̮̫̭̙̰̐̾̀ͪͮͬ̽̄̽͗́̕͜͟ i̷̶̧̛̛̻̼͔͉̥̩̟̞̲̩̮ͦ̆͑ͨ̌̾̑̓̓͐̂͛̇͢͡_̧ͅţ̸̴͈͇͔͉̰̟̂̂ͫ̍͗̔ͮ̽ͦ̅ͩͧ̆̌͝͝͠!̷̶̷̡̨̡̧̧̛̳̯̻͎͔͇̜̖͓͉̻͗ͩ̐ͣ̀̊̌̉̅̅̀́̊̿͂̈́͘͡ͅ_

#     """
#     return res

# FUNCTION: SCENE 3
def scene3(step):
    """Scene 3: """

    if step == 14:
        res = scene3_animation()
    elif step == 15:
        res = "Warning"
    elif step == 16:
        res = "AMiss"
    elif step == 17:
        res = "Audition Program"
    elif step == 18:
        res = "Error Reset"
    
    # Update the step
    next_step = step + 1

    return res, next_step
